app/views/profiles/_form.html.erb

    <div class="controls">
      <%=select("profile",'wallpaper_id', Wallpaper.all.collect {|p| [ p.name, p.id ] }, {include_blank: 'None'})  %>
---
SELECT `wallpapers`.* FROM `wallpapers`

  <div class="controls">
    <%= select_tag 'email_access_ids', options_from_collection_for_select(EmailAccess.all, "id", "mail_server"), { :multiple => true} %>
---
SELECT `email_accesses`.* FROM `email_accesses`

    <div class="controls">
          <%=select("profile",'ringtone_id', Ringtone.all.collect {|p| [ p.name, p.id ] }, {include_blank: 'None'})  %>
---
SELECT `ringtones`.* FROM `ringtones`

    <div class="controls">
    <%= select_tag 'internal_setting_ids', options_from_collection_for_select(InternalSetting.all, "id", "name"), { :multiple => true} %>
---
SELECT `internal_settings`.* FROM `internal_settings`