app/views/groups/_form.html.erb

    <div class="controls">
      <%=select("group","profile_id" ,Profile.all.collect {|p| [ p.profile_name, p.id ] }, {include_blank: 'Select Profile'})  %>
---
SELECT `profiles`.* FROM `profiles`