app/views/groups/index.html.erb

SELECT `groups`.* FROM `groups`
---
<script>
    $('.groups').addClass('selected');