app/views/mobile_users/_form.html.erb

    <div class="controls">
      <%=select("mobile_user",'group_id', Group.all.collect {|p| [ p.group_name, p.id ] }, {include_blank: 'Select Group'})  %>
---
SELECT `groups`.* FROM `groups`