app/controllers/api/v1/registration_controller.rb

SELECT  `mobile_users`.* FROM `mobile_users`  WHERE `mobile_users`.`user_name` = 'ykakarla' LIMIT 1
INSERT INTO `mobile_users` (`created_at`, `first_name`, `last_name`, `reg_id`, `updated_at`, `user_name`) VALUES ('2014-09-10 09:41:47', 'Krishnaiah', 'Yelika', 'APA91bET5p8ZdF2-gSyJt__1SbhR8HLv7X1mSrPLK4SVL3jzMb9DdwOucKfYKDOnp9WkmRMglh0EmfG7kF_Oi707fWX7HHpQrhJ45EyKhrMjWM8eK7w1vqlBSicZcTQjf3HgUDiqeDzH', '2014-09-10 09:41:47', 'kyelika')
UPDATE `mobile_users` SET `first_name` = 'Yaswanth', `last_name` = 'Kakarla', `reg_id` = 'APA91bET5p8ZdF2-gSyJt__1SbhR8HLv7X1mSrPLK4SVL3jzMb9DdwOucKfYKDOnp9WkmRMglh0EmfG7kF_Oi707fWX7HHpQrhJ45EyKhrMjWM8eK7w1vqlBSicZcTQjf3HgUDiqeDzH', `updated_at` = '2014-09-10 09:33:43' WHERE `mobile_users`.`id` = 3
SELECT  `devices`.* FROM `devices`  WHERE `devices`.`imei` = '353721051936619' LIMIT 1
---
  def login
  	if params[:username].blank? || params[:password].blank?
  		render  :text => "{\"credentials\":invalid}" ,:status => 201
  	else
  		user = mobile_authenticate_user(params)
  		if user
        first_name = user.displayname.first.split(' ')[0]
        last_name = user.displayname.first.split(' ')[1]
        mobile_user = MobileUser.find_by_user_name(params[:username])
        if mobile_user.blank?
          mobile_user = MobileUser.new
        end
        mobile_user.user_name = params[:username]
        mobile_user.first_name = first_name
        mobile_user.last_name = last_name
        # mobile_user.dob = params[:dob]
        # mobile_user.gender = params[:gender]
        # mobile_user.employee_id = params[:employee_id]
        # mobile_user.mobile = params[:mobile]
        mobile_user.registration_id = params[:secretkey]
        if mobile_user.save!
          device = Device.find_by_imei(params[:imei])

INSERT INTO `devices` (`created_at`, `device_type`, `imei`, `mobile_user_id`, `serial_number`, `updated_at`, `version`) VALUES ('2014-09-10 09:33:43', 'Android', '353721051936619', 3, 'APA91bET5p8ZdF2-gSyJt__1SbhR8HLv7X1mSrPLK4SVL3jzMb9DdwOucKfYKDOnp9WkmRMglh0EmfG7kF_Oi707fWX7HHpQrhJ45EyKhrMjWM8eK7w1vqlBSicZcTQjf3HgUDiqeDzH', '2014-09-10 09:33:43', '4.1.2')
UPDATE `devices` SET `serial_number` = 'APA91bEGRNfy-8O9ulu30bKzoHKqwh4W_JdCLaFxTqgLs2UtknhFx1SI_P6RHwEWZkwCZa7y23WebPRI-rK7839yQ2ExwVHbDOib25JOTq__QMvBSzYyp6jv0ftrY-sGM7jSjrLHj-fcbTufsFZa5FdMnuRU-NP6NA', `updated_at` = '2014-09-10 12:30:57' WHERE `devices`.`id` = 5
SELECT  `activity_logs`.* FROM `activity_logs`  WHERE `activity_logs`.`activity` = 'Enroll Device' AND `activity_logs`.`status` = 'Succeeded' LIMIT 1
---
      		device.supervised = params[:supervised]
          device.mobile_user_id = mobile_user.id
          device.imei = params[:imei]
      		if device.save!
            activity_log = ActivityLog.find_by_activity_and_status('Enroll Device', 'Succeeded')

INSERT INTO `activity_logs` (`activity`, `created_at`, `mobile_user_id`, `status`, `updated_at`) VALUES ('Enroll Device', '2014-09-10 13:49:47', 3, 'Succeeded', '2014-09-10 13:49:47')
---
              activity_log.activity = 'Enroll Device'
              activity_log.status = 'Succeeded'
              activity_log.mobile_user_id = mobile_user.id
              activity_log.save