app/controllers/activity_logs_controller.rb

  def index
    @activity_logs = ActivityLog.all
---
SELECT `activity_logs`.* FROM `activity_logs`

  def destroy
    @activity_log.destroy
---
DELETE FROM `activity_logs` WHERE `activity_logs`.`id` = 2

    def set_activity_log
      @activity_log = ActivityLog.find(params[:id])
---
SELECT  `activity_logs`.* FROM `activity_logs`  WHERE `activity_logs`.`id` = 63 LIMIT 1