app/controllers/device_groups_controller.rb

SELECT `device_groups`.* FROM `device_groups`
---
  def index
    @device_groups = DeviceGroup.all

INSERT INTO `device_groups` (`created_at`, `name`, `updated_at`) VALUES ('2014-09-08 09:33:46', 'df', '2014-09-08 09:33:46')
---
  def create
    @device_group = DeviceGroup.new(device_group_params)

    respond_to do |format|
      if @device_group.save

SELECT  `device_groups`.* FROM `device_groups`  WHERE `device_groups`.`id` = 1 LIMIT 1
---
    def set_device_group
      @device_group = DeviceGroup.find(params[:id])