app/controllers/devices_controller.rb

SELECT  `devices`.* FROM `devices`   ORDER BY `devices`.`id` ASC LIMIT 1
---
  def index
    @devices = Device.all

INSERT INTO `devices` (`capacity`, `created_at`, `device_type`, `mobile_user_id`, `serial_number`, `supervised`, `updated_at`, `version`) VALUES ('yadad', '2014-09-05 11:32:21', 'Yash', 0, 'yash', 'lkjhkljh', '2014-09-05 11:32:21', 'kljhkh')
---
  def create
    @device = Device.new(device_params)

    respond_to do |format|
      if @device.save

SELECT  `devices`.* FROM `devices`  WHERE `devices`.`id` = 4 LIMIT 1
---
    def set_device
      @device = Device.find(params[:id])