app/controllers/email_accesses_controller.rb

  def index
    @email_accesses = EmailAccess.all
---
SELECT `email_accesses`.* FROM `email_accesses`