app/controllers/groups_controller.rb

SELECT `groups`.* FROM `groups`
---
  def index
    @groups = Group.all

SELECT  `wallpapers`.* FROM `wallpapers`  WHERE `wallpapers`.`id` = 1 LIMIT 1
SELECT  `ringtones`.* FROM `ringtones`  WHERE `ringtones`.`id` = 1 LIMIT 1
SELECT `mobile_users`.* FROM `mobile_users`  WHERE `mobile_users`.`group_id` = 1
---
  def show
    @profile = @group.profile
    @wallpaper = nil
    if !@profile.ringtone.nil?
      @wallpaper = "#{Rails.root.join('public')}" + @profile.wallpaper.avatar.url
    end
    @ringtone = nil
    if !@profile.ringtone.nil?
      @ringtone = "#{Rails.root.join('public')}" + @profile.ringtone.source.url
    end
    @group.mobile_users.each do |mobile_user|

INSERT INTO `groups` (`created_at`, `group_name`, `profile_id`, `updated_at`) VALUES ('2014-09-10 12:26:49', 'Yaswanth23', 3, '2014-09-10 12:26:49')
---
  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save

UPDATE `groups` SET `profile_id` = 2, `updated_at` = '2014-09-10 10:18:02' WHERE `groups`.`id` = 1
---
  def update
    respond_to do |format|
      if @group.update(group_params)