app/controllers/internal_settings_controller.rb

SELECT `internal_settings`.* FROM `internal_settings`
---
  def index
    @internal_settings = InternalSetting.all

INSERT INTO `internal_settings` (`created_at`, `name`, `updated_at`) VALUES ('2014-09-10 10:22:25', 'Setting2', '2014-09-10 10:22:25')
---
  def create
    @internal_setting = InternalSetting.new(internal_setting_params)

    respond_to do |format|
      if @internal_setting.save

SELECT  `internal_settings`.* FROM `internal_settings`  WHERE `internal_settings`.`id` = 2 LIMIT 1
---
    def set_internal_setting
      @internal_setting = InternalSetting.find(params[:id])