app/controllers/mobile_users_controller.rb

  def index
    @mobile_users = MobileUser.all
---
SELECT `mobile_users`.* FROM `mobile_users`

  def show
    @mobile_user = MobileUser.find(params[:id])
    if @mobile_user.group
      @profile = @mobile_user.group.profile
      @wallpaper = nil
      if !@profile.wallpaper.nil?
        @wallpaper = "#{Rails.root.join('public')}" + @profile.wallpaper.avatar.url
      end
      @ringtone = nil
      if !@profile.ringtone.nil?
        @ringtone = "#{Rails.root.join('public')}" + @profile.ringtone.source.url
---
SELECT  `mobile_users`.* FROM `mobile_users`  WHERE `mobile_users`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `groups`.* FROM `groups`  WHERE `groups`.`id` = 1 LIMIT 1
SELECT `mobile_users`.* FROM `mobile_users`
SELECT  `profiles`.* FROM `profiles`  WHERE `profiles`.`id` = 1 LIMIT 1
SELECT  `wallpapers`.* FROM `wallpapers`  WHERE `wallpapers`.`id` = 1 LIMIT 1
SELECT  `ringtones`.* FROM `ringtones`  WHERE `ringtones`.`id` = 1 LIMIT 1

  def update
    respond_to do |format|
      if @mobile_user.update(mobile_user_params)
---
UPDATE `mobile_users` SET `group_id` = 1, `mobile` = '', `updated_at` = '2014-09-10 09:54:01' WHERE `mobile_users`.`id` = 3

  def destroy
    @mobile_user.destroy
---
DELETE FROM `mobile_users` WHERE `mobile_users`.`id` = 2

    def set_mobile_user
      @mobile_user = MobileUser.find(params[:id])
---
SELECT  `mobile_users`.* FROM `mobile_users`  WHERE `mobile_users`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1