app/controllers/profiles_controller.rb

SELECT `profiles`.* FROM `profiles`
---
  def index
    @profiles = Profile.all

INSERT INTO `profile_internal_settings` (`internal_setting_id`, `profile_id`) VALUES (1, 2)
INSERT INTO `profiles` (`access_to_os`, `call_recording`, `camera`, `created_at`, `device_mode`, `expiry`, `gprs`, `password_length`, `password_type`, `profile_name`, `ringtone_id`, `secure_pictures`, `set_password`, `spy_recording`, `timezone`, `updated_at`, `wallpaper_id`, `wifi`) VALUES (0, 1, 0, '2014-09-10 10:59:09', 1, '09/23/2014', 1, 23, 'General', 'Test1', 1, 1, 1, 0, 'Saskatchewan', '2014-09-10 10:59:09', 2, 1)
INSERT INTO `profile_email_accesses` (`email_access_id`, `profile_id`) VALUES (1, 2)
---
  def create
    @profile = Profile.new(profile_params)
    if params['internal_setting_ids'].present?
        params['internal_setting_ids'].each do |internal_setting_id|
        @profile_internal_setting = @profile.profile_internal_settings.build(:internal_setting_id => internal_setting_id)
        @profile_internal_setting.save
      end
    end

    if params['email_access_ids'].present?
        params['email_access_ids'].each do |email_access_id|
        @profile_email_access = @profile.profile_email_accesses.build(:email_access_id => email_access_id)
        @profile_email_access.save

INSERT INTO `profile_internal_settings` (`internal_setting_id`, `profile_id`) VALUES (1, 2)
INSERT INTO `profile_email_accesses` (`email_access_id`, `profile_id`) VALUES (1, 2)
---
  def update
    if params['internal_setting_ids'].present?
      @profile.profile_internal_settings.delete_all
      params['internal_setting_ids'].each do |internal_setting_id|
        @profile_internal_setting = @profile.profile_internal_settings.build(:internal_setting_id => internal_setting_id)
        @profile_internal_setting.save
      end
    end

    if params['email_access_ids'].present?
        @profile.profile_email_accesses.delete_all
        params['email_access_ids'].each do |email_access_id|
        @profile_email_access = @profile.profile_email_accesses.build(:email_access_id => email_access_id)
        @profile_email_access.save

SELECT  `profiles`.* FROM `profiles`  WHERE `profiles`.`id` = 2 LIMIT 1
---
    def set_profile
      @profile = Profile.find(params[:id])