app/controllers/ringtones_controller.rb

SELECT `ringtones`.* FROM `ringtones`
---
  def index
    @ringtones = Ringtone.all