app/views/layouts/_sidebar_device_groups.html.erb

<% @device_groups = DeviceGroup.all %>
---
SELECT `device_groups`.* FROM `device_groups`