app/views/layouts/_sidebar_profiles.html.erb

<% @profiles = Profile.all %>
---
SELECT `profiles`.* FROM `profiles`