app/views/layouts/_sidebar_devices.html.erb

<% @devices = Device.all %>
---
SELECT `devices`.* FROM `devices`