app/views/layouts/_sidebar_users.html.erb

<% @mobile_users = MobileUser.all   %>
---
SELECT `mobile_users`.* FROM `mobile_users`