app/views/layouts/_sidebar_groups.html.erb

SELECT `groups`.* FROM `groups`
---
<% @groups = Group.all %>